Revit 2027 API
Noise.NoiseThresholdHigh Property
 The property labeled "High" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string NoiseThresholdHigh { get; }
Public Shared ReadOnly Property NoiseThresholdHigh As String
	Get
public:
static property String^ NoiseThresholdHigh {
	String^ get ();
}
static member NoiseThresholdHigh : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
Noise Class
Autodesk.Revit.DB.Visual Namespace